{"title":"meredrica's ramblings","description":"stuff I write","language":"en","link":"https://meredrica.github.io/hexo-theme-material-image","pubDate":"Sun, 11 Sep 2016 20:24:00 GMT","lastBuildDate":"Mon, 10 Oct 2016 17:26:04 GMT","generator":"hexo-generator-json-feed","webMaster":"meredrica","items":[{"title":"Kurzgeschichte: Mr. Ego\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/09/11/Kurzgeschichte-Mr-Ego/","description":"Eine kleine Kurzgeschichte welche mir am Heimweg aus Berlin eingefallen ist und sofort niedergeschrieben werden musste. Enjoy.“Lass es doch einfach!” sage ich. Schon wieder. Seit einer gefühlten Ewigkeit versuche ich nun diesen Idioten von seinem Trip runter zu holen. Ich habe ihm jetzt zig Mal erklärt dass das keine gute Idee ist, dass das hier niemand braucht und niemandem hilft. Mir nicht und ihm ganz sicher auch nicht. Vergebens.Plötzlich ändert sich seine Körperspannung. War ja klar, er kann es nicht lassen. Ich habe jetzt lange genug versucht das zu vermeiden, meine Geduld ist nun zu Ende. Meine Optionen ebenfalls, die hat Mr. Ego gerade höchstpersönlich vernichtet. Na gut, dann eben so.","pubDate":"Sun, 11 Sep 2016 20:24:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/09/11/Kurzgeschichte-Mr-Ego/","category":"german,writing"},{"title":"Bi\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/07/21/Bi/","description":"BiLingualBiPedualBiDextrousBiPhasicBiHemisphericBiNocularBiPolarBiNomialBiLiteralBiSexualBiDirectionalBiCentralI am so damn Bi","pubDate":"Wed, 20 Jul 2016 23:23:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/07/21/Bi/","category":"english,writing"},{"title":"Expect more German\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/05/26/Expect-more-German/","description":"In the future, I will start writing posts in German.This blog has always been about my opinions on things. I’ve used it to vent my rage and anger, as well as my fears. It’s been about my life, things I like and work on and an outlet for my poetry.I chose to write in English because I like it. I write a lot of texts, mostly poetry, that I never make public.Writing is always about my personal opinion and views on things. Lately, there has been a lot going on in Austria that I want to talk about. Using English for this seems kind of strange, I want my readers (which are very few, but who cares) to have it easy to follow the posts. I’ll also have to use a lot of German terms that I don’t want to translate because it’s a lot of work.","pubDate":"Thu, 26 May 2016 16:38:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/05/26/Expect-more-German/","category":"english"},{"title":"How To: Gi zusammenlegen\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/04/12/How-To-Gi-zusammenlegen/","description":"Ich besitze derzeit 7 (oder 8?) Gis und werde oft gefragt wie man einen Gi so zusammen legen kann dass er ohne Falten transportiert werden kann.Daher hier ein How-To in Bildern. Der Gi ist in diesem Fall absichtlich nicht gebügelt, wenn man ihn so eine Woche im Kleiderschrank aufbewahrt erledigt sich das von selbst.","pubDate":"Tue, 12 Apr 2016 15:00:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/04/12/How-To-Gi-zusammenlegen/","category":"german,martial arts"},{"title":"1. Dan\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/04/12/1-Dan/","description":"Ich habe am 18.3.2016 erfolgreich meine Prüfung zum 1. Dan JuJitsu abgelegt.Die Vorbereitungen haben mich und meinen Uke, +Lorenz Hammel gute 3 Monate beansprucht.Im Rahmen der Vorbereitung habe ich 70 Waza Ketten erarbeitet und auswendig gelernt. Ich habe dabei besonderes Augenmerk darauf gelegt Techniken nicht zu wiederholen. Es war mir noch nicht möglich alles zu Zählen aber ich schätze es sind gute 250 verschiedene Techniken.Es handelt sich hier um das Ergebnis von ca 7 Jahren Training.Mein Weg in der sanften Kunst ist dadurch aber alles andere als beendet. Jetzt geht es erst richtig los. Es ist an der Zeit mein Wissen noch weiter zu fächern und es an alle zukünftigen JuJitsuka weiter zu geben.","pubDate":"Tue, 12 Apr 2016 14:45:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/04/12/1-Dan/","category":"german,martial arts"},{"title":"Poem: Be Who You Are\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/03/09/Poem-Be-Who-You-Are/","description":"Be who you are she said.Sounds so easy, is so hard.It needs passion, it needs art.Feeding on this beating heart.How can you be what no one is?Be it an angel or the beast.No one tells and no one knows.Depths inside that you don’t show.I am what I am and I acceptwhatever’s hiding in this depth.If you don’t like it, so be it.I lead my life how I see fit.","pubDate":"Wed, 09 Mar 2016 22:06:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/03/09/Poem-Be-Who-You-Are/","category":"english,writing"},{"title":"A Strange Mistress\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/02/06/A-Strange-Mistress/","description":"Feelings are strange. Sometimes they just jump into your face out of nowhere, stay there for a few moments and then leave again. The hard part is to deal with these moments.I haven’t written anything in the last few months. Then suddenly, along comes an old feeling that feels a lot less intense than it did in my last life. Looks like I changed a lot.Anyway, I decided I’d write about it. It’s not a particularly good text and I just wrote it down the way it fell out of my head. It’s not as refined as most of my texts which usually take a few days to a few weeks to be finished, if ever.","pubDate":"Sat, 06 Feb 2016 02:35:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2016/02/06/A-Strange-Mistress/","category":"english,writing"},{"title":"FCS Level 1\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/11/30/FCS-Level-1/","description":"Ich habe am 3. November 2015 erfolgreich die FCS Level 1 Prüfung abgelegt.Super vielen dank an meinen wirklich guten Freund Thilo Würkner der mich Trainiert hat. Ohne dich hätte ich das nicht.v.L.n.R.: Eugen Dahm, Daniel Neuretter, Ray Dionaldo, Thilo Würkner, Ich","pubDate":"Mon, 30 Nov 2015 10:50:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/11/30/FCS-Level-1/","category":"german,martial arts"},{"title":"Ist das JuJitsu?\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/11/30/Ist-das-JuJitsu/","description":"Ich habe in der letzten Zeit einiges an Lehrgängen besucht. Wie jedes Jahr.Dabei waren heuer: 5. Osterlehrgang mit Josef Linder, Budo Pfingstlehrgang Ansbach, Pinkafeld Gedenklehrgang für Franz Strauss, FCS Germany Gathering, FCS Austria Lehrgang und natürlich auch wieder der Kampfkunst/Ich hab Spaß mit Freunden - Urlaub in Göstling.FCS Germany Gathering.Hier irgendwo versteckt:Ray DionaldoWilfried HarloffTim BlaschkeRené ZellerThilo WürknerDaniel NeuretterIch","pubDate":"Mon, 30 Nov 2015 10:01:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/11/30/Ist-das-JuJitsu/","category":"german,martial arts"},{"title":"Poem: The Devil is Moving\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/07/11/Poem-The-Devil-is-Moving/","description":"The devil is moving, it’s out of control.It broke my heart now it is after my soul.It made me lose all my self control and forced me to endure the worst of it all.It made me a devil I never wanted to know.Took me to a dark place in my very own soul.One day I broke out of it’s tight control started a new life without all this sorrow.The devil is moving but now I’m not alone.I found an angel, a very kind soul.It showed me that there is still so much more to know, feelings to share and wonders to behold.","pubDate":"Sat, 11 Jul 2015 19:45:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/07/11/Poem-The-Devil-is-Moving/","category":"english,writing"},{"title":"Strange Times\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/07/02/Strange-Times/","description":"I’m having a rather strange year. Very different to the last one.While the first half was terrible, in fact the darkest time of my whole life, but the recent past is the complete opposite. I can’t remember that I ever had such a positive attitude. My usual mindset was pessimistic and often depressed.Now, this is a little paradox because I’m in the middle of getting divorced. But I realized it’s the right decision. When this is sorted out, I can start working on a new future. If I can be bothered that is. Right now it is good to just live happy, healthy and not have plans.","pubDate":"Thu, 02 Jul 2015 10:14:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/07/02/Strange-Times/","category":"english,life,recovery"},{"title":"Poem: The Wild Blossom\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/07/01/Poem-The-Wild-Blossom/","description":"It’s just a small and fragile thing.Was born in an unusual spring.It yearns for summer’s tender wind.It does not care what autumn brings.The winter made this peaceful thing.And then the blossom starts to sing.Oh life, you are a wondrous thing!Sun on my leaves, now does beginanother tale of grass and green.Of how I love this tender stream,the raindrops running down my skin.Now the wild blossom grows in size.It is still young but might arise,might be the mightiest in size!Or could just grow to normal size.","pubDate":"Wed, 01 Jul 2015 06:26:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/07/01/Poem-The-Wild-Blossom/","category":"english,writing,recovery"},{"title":"Moving on\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/06/22/Moving-on/","description":"So much has changed. The last one and a half years were hard but I pulled through.I learned a lot about life. Albeit the price for this learning experience was too high.Our relationship broke, we will get divorced. I think it was broken beyond repair since last year’s August.I just could not accept it. Now I can - I’m ready to move on.I learned a lot. How to live alone, how to trust less, how it feels to lose all of your future against your will.How it feels when one of your closest friends betrays you in ways you can’t really imagine and can’t ever forgive nor forget.I learned that nothing in life is as important as friends and family that help you through dark times. I would definitely not have made it without you guys.My friends who provided shelter, moral support and drinking buddies. The people that would listen to my endless rants and take my ailments serious.You provided help in the darkest time of my life. I am forever in your dept. I don’t take all this for granted.This is a short updated, compared to the last few posts. But it’s one that is not written in a depressed mindset for once.In fact, I have never felt so comfortable in my own skin before.","pubDate":"Mon, 22 Jun 2015 17:28:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/06/22/Moving-on/","category":"english,life,recovery"},{"title":"This blog needs an update\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/06/21/This-blog-needs-an-update/","description":"And I will write one in the near future.I’m fine. A lot has changed. Life is a roller coaster ride.","pubDate":"Sun, 21 Jun 2015 17:29:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/06/21/This-blog-needs-an-update/","category":"english"},{"title":"What the hell have I done?\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/03/18/What-the-hell-have-I-done/","description":"I couldn’t control myself. I had another emotional breakdown and ruined a lot again. I have no idea if this damage can ever be repaired.It’s the first time that my sickness got me. I hate myself for not thinking longer before speaking. I wasn’t myself and let my broken parts cause havoc.This might have been the biggest mistake ever. I have no idea if this problem is fixable, and I am the only one to blame.I hate myself right now. I hate my disease. I cause chaos again, in a time where chaos can ruin everything. I messed with our stability. I am stupid and unstable and I did not want all of this.","pubDate":"Wed, 18 Mar 2015 10:57:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/03/18/What-the-hell-have-I-done/","category":"english,life,relapse"},{"title":"Comfort\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/03/11/Comfort/","description":"Sometimes you find comfort in strange places.I reached a new low last week and came out faster and stronger than ever before.Therapy seems to work better than I acknowledged.","pubDate":"Wed, 11 Mar 2015 14:57:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/03/11/Comfort/","category":"english,life,recovery"},{"title":"Eleven years\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/03/02/Eleven-years/","description":"So this is it. After eleven years, I am single again. We had ten wonderful years and one troubled one. We tried getting back on course. First I was not ready, then she wasn’t, still isn’t. I just broke up with the person I love more than anything else (My daughter excluded of course. Alice trumps everything, all the time).We decided to stop having a relationship for the coming month. Nicole needs to get her life together and this is the only way in which I can help. I trade my happiness for her well being. Love makes you do crazy things.Nicole might be ready tomorrow. Or in a week or a year. And her decision might change just as quick. She is currently so messed up that there is simply no point in carrying on. I know because I tried. I gave my best but fixing a relationship is not a solo project.","pubDate":"Sun, 01 Mar 2015 23:55:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/03/02/Eleven-years/","category":"english,life,recovery"},{"title":"Love\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/02/28/Love/","description":"Love will break.Sometimes it is fixable.Sometimes it has to be replaced.We were supposed to take on the world.– Avatar, Torn Apart","pubDate":"Sat, 28 Feb 2015 12:50:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/02/28/Love/","category":"english,life"},{"title":"Agony\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/02/27/Agony/","description":"I’m spent.I’m done.Happiness has gone.","pubDate":"Fri, 27 Feb 2015 08:56:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/02/27/Agony/","category":"english,life,relapse"},{"title":"Betrayal\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/02/23/Betrayal/","description":"From all the feelings that I ever felt, betrayal is the hardest to stomach.I thought things were getting better. Was I naive again? I can’t tell.Nicole still sees him, has daily contact. Thomas Handschuh, a guy I once counted to my best friends, and whom I have never named as one of the sources of my misery, is still trying to botch my life. He just can’t get the fuck out of my way and let me try to heal my family. I wanted to have him back as a friend. Not anymore.","pubDate":"Mon, 23 Feb 2015 11:29:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/02/23/Betrayal/","category":"english,life,recovery"},{"title":"My condition: Home, Diagnosis and Bad Habits\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/02/20/My-condition-Home-Diagnosis-and-Bad-Habits/","description":"Last time I left some questions unanswered. This was mainly due to the fact that I had no answers to them. So I guess it is time for an update on my current situation.I was couch surfing for a week and stayed with my relatives in Vienna. I also had a lot of talks and phone calls with many friends and family members. I have to say, I know some pretty awesome people. Thank you all for your support, kind words, suggestions and support. Also, let’s not forget the evenings with (a bit of) beer and deep, thoughtful discussions.The next week, Nicole stayed out of the flat and I moved back in. We actually were a lot at home together, to spend time with our daughter. Needless to say, she was extremely confused and did not understand what was going on or why we were not all sleeping at home.Sleeping in separate locations was rather strange but it helped a lot. It introduced some calm into our relationship which we desperately needed. This, along with the fact that I picked up therapy, eventually led to Nicole stopping her affair and we are now living together again.","pubDate":"Fri, 20 Feb 2015 13:46:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/02/20/My-condition-Home-Diagnosis-and-Bad-Habits/","category":"english,life,recovery"},{"title":"Poem: Helter Skelter\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/01/28/Poem-Helter-Skelter/","description":"Your life goes quickly helter skelterThen you’re left without your shelterA heartless warning left unreadA shitty place inside my headWhoever this might one day read:Beware, your demons are a threat","pubDate":"Tue, 27 Jan 2015 23:05:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/01/28/Poem-Helter-Skelter/","category":"english,writing,life"},{"title":"Checking\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/01/22/Checking/","description":"Checking. Refresh.No news. No stress.Checking. Refresh.A Poem. Sadness.Checking. Refresh.No Trust. Helpless.Checking. Refresh.Horrible. Flashback.Checking. Refresh.Future. What else?Checking. Refresh.Healing. Kindness.Checking. Refresh.My life was a mess.","pubDate":"Thu, 22 Jan 2015 13:12:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/01/22/Checking/","category":"english,writing,life,recovery"},{"title":"meredrica, the great Destroyer \n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/01/21/meredrica-the-great-Destroyer-/","description":"I call myself meredrica. I absolutely habe no idea where that name comes from. It sprang to my mind one day and since then, I use it most of the time when I get the chance.I don’t know about phonetic lettering but in German you would say meredrika.Sometimes I also used the name meredrica destructa, usually when somebody decided that you can’t use more than one word for a second name (I never got why that would be needed).I like that name. It does not have any deeper meaning.The bywords however, do. I always thought of myself to be capable of destroying everything that I had to. Or everything that managed to push me hard enough. Or everything that I wanted to destroy. It never crossed my mind that I might one day use my special powers against myself.","pubDate":"Wed, 21 Jan 2015 20:39:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/01/21/meredrica-the-great-Destroyer-/","category":"english,life,recovery"},{"title":"How I stopped having plans and ruined my future\n","link":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/01/20/How-I-stopped-having-plans-and-ruined-my-future/","description":"I have no idea how to begin this post.Today, I will move out. Out of the home that we built together as a family. The flat that was supposed to be the seed of our future.I was so fucking stupid I can’t even believe it myself. The last year was a complete mess, and I really have nobody else to blame but myself. I don’t really know what I was trying to do. Maybe I was just trying to find myself.What I’ve found is nothing pretty.I had depressions all my life and still have. The first time I attempted suicide, I was 14 years old, sitting with a rope around my neck at my bed, in my parents house. I don’t remember much before that.It was a miracle that I got to 16. Back then, I was lucky to meet the right people which helped keep me alive. I was feeling alone and unloved most of the time, until I met somebody that was just as fucked up as me, and we pulled ourselves out of the dirt.When I was almost 18, I met my future wife. I suddenly had a future. I was afraid that I’d never make it to my 20th birthday. And then it came and went. And I got to 21. I got engaged and married with 22, celebrating my 23rd birthday during our honeymoon.Forever","pubDate":"Tue, 20 Jan 2015 10:02:00 GMT","guid":"https://meredrica.github.io/hexo-theme-material-image/hexo-theme-material-image/2015/01/20/How-I-stopped-having-plans-and-ruined-my-future/","category":"english,life,recovery"}]}